rcm_cold/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM:.Uhe Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "${FOAM_CASE}/constant/caseSettings"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $:internalField.U;

boundaryField
{
    back
    {
        type            wedge;
    }
    front { $back; }
    liner { $:wall.U; }
    cylinderHead { $liner; }
    piston { $:piston.U; }
    crevice { $piston; }
    creviceUp { $crevice; }
    creviceDown { $crevice; }
}

}


// ************************************************************************* //
