rcm_cold/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM:.phe Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "${FOAM_CASE}/constant/caseSettings"

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $:internalField.p;

boundaryField
{
    back
    {
        type            wedge;
    }
    front { $back; }
    liner { $:wall.p; }
    cylinderHead { $liner; }
    piston { $liner; }
    crevice { $piston; }
    creviceUp { $crevice; }
    creviceDown { $crevice; }
}

}


// ************************************************************************* //
