rcm_cold/0.orig/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "${FOAM_CASE}/constant/caseSettings"

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    back
    {
        type            wedge;
    }
    front { $back; }
    liner { $:wall.alphat; }
    cylinderHead { $liner; }
    piston { $liner; }
    crevice { $piston; }
    creviceUp { $crevice; }
    creviceDown { $crevice; }
}


// ************************************************************************* //
