rcm_cold/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM:.khe Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "${FOAM_CASE}/constant/caseSettings"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $:internalField.k;

boundaryField
{
    back
    {
        type            wedge;
    }
    front { $back; }
    liner { $:wall.k; }
    cylinderHead { $liner; }
    piston { $liner; }
    crevice { $piston; }
    creviceUp { $crevice; }
    creviceDown { $crevice; }
}


// ************************************************************************* //
