rcm_cold/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "${FOAM_CASE}/constant/caseSettings"

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $:internalField.omega;

boundaryField
{
    back
    {
        type            wedge;
    }
    front { $back; }
    liner { $:wall.omega; }
    cylinderHead { $liner; }
    piston { $liner; }
    crevice { $piston; }
    creviceUp { $crevice; }
    creviceDown { $crevice; }
}

// ************************************************************************* //
